---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongCutBoundaryLoops
source: html/cb709165-67ca-e2a9-cf4f-5e467b426d06.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongCutBoundaryLoops Property

Only open loops can be used for Edit Cut Profile. All open ends must lie on the boundary of the cut profile, and the loop may not
 touch the boundary anywhere except at its ends.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongCutBoundaryLoops { get; }
```